{
    "title": "Wyszukiwarka artykułów",
    "app.languagePl": "Polski",
    "app.languageEn": "Angielski",
    "header.list": "Lista",
    "header.tiles": "Kafelki",
    "header.info": "Info",
    "header.infoTooltip": "Najtrudniejszą rzeczą w tym zadaniu było zmagania z czasem, ponieważ pracuję jako programista React w Szczecinie i codziennie muszę dojeżdżać do pracy 100 km w jedną stronę. Po pracy pracuję również dla innej firmy, więc znalezienie czasu na to zadanie było bardzo trudne. Dodatkowo, trafienie w gusta waszych preferencji programistycznych było jak loteria, ponieważ każdy ma nieco inny pomysł na architekturę. Na przykład ja nie trzymam slice'ów w folderze Redux, ale w folderze features, gdzie znajduje się główny indeks komponentu dla danej części aplikacji.Testy napisałem skromne to też właśnie związane było z czasem no niby napisaliście że czas do końca marca ale jednak na git było max 12h więc stwierdziłem żę maksymalnie 8h na to przeznaczę. Jeśli chodzi o samo wyzwanie, było ono podobne do największych trudności.",
    "header.infoTitle":"Trudności i frajdy",
    "footer.count": "Liczba artykułów: ",
    "footer.currentTime": "Godzina: ",
    "popup.author": "Autor:",
    "popup.source": "Zródło:",
    "spiner.loading": "Wczytywanie...",
    "title.homePage": "Strona główna",
    "home.howToUse.title": "Jak korzystać:",
    "home.howToUse.step1": "Po lewej stronie znajduje się lista krajów. Kliknij na kraj, aby zobaczyć powiązane z nim artykuły newsowe.",
    "home.howToUse.step2": "Po kliknięciu na kraj pojawi się reaktywna tabela z artykułami newsowymi związanych z wybranym krajem.",
    "home.howToUse.step3": "Kliknij na artykuł newsowy, aby przejść do jego szczegółów w aplikacji.",
    "home.howToUse.step4": "W aplikacji możesz również przełączać się między różnymi językami, aby wyświetlać treści w preferowanym języku.",
    "home.technologiesUsed.title": "Wykorzystane technologie:",
    "home.technologiesUsed.react": "React: Biblioteka JavaScript do budowy interfejsów użytkownika.",
    "home.technologiesUsed.typescript": "TypeScript: Typowany nadzbiór języka JavaScript, który pomaga poprawić jakość kodu i produktywność programisty.",
    "home.technologiesUsed.reactRouter": "React Router: Biblioteka routowania do deklaratywnej nawigacji w aplikacji React.",
    "home.technologiesUsed.otherLibraries": "Inne biblioteki i narzędzia specyficzne dla projektu mogą być tutaj wymienione.",
    "home.apiInfo": "Wykorzystałem te API, ponieważ chciałem dodać możliwość wyboru języka w mojej aplikacji. Niestety, to API nie zawierało właściwego identyfikatora dla artykułu, dlatego postanowiłem użyć tytułu artykułu jako identyfikatora. Z tego powodu nie mogłem bezpośrednio pobrać pojedynczego artykułu za pomocą REST API. Musiałem więc znaleźć obejście i pobierać artykuły na podstawie tytułu z mojego reduktora. Wiem, że API dla książek mogłoby być lepsze, a może nawet wygodniejsze, do wykonania tego zadania, ale nie było to dla mnie problemem."
  }